---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner
source: html/7a0d0391-3f99-9c82-9e1a-7be5672f66c2.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner

The options for the line shape of a stairs path at a corner.

## Syntax (C#)
```csharp
public enum StairsPathLineShapeAtCorner
```